<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"45a73440a0ccb5c5a2319277c8a3ead0b4542acd003a3bfb06176c0e94c8ee99","plan_job_ref":"Job Tests for PRs #359 at https://github.com/GSA-TTS/FAC/actions/runs/5137054957","plan_hash":"91ec6972d8ccdce2000f58dc38e138f5892f81472ba24726fc175f4a15f8feb3","plan_text_format":"text","version":"1.34.0"} -->
Terraform plan for __production__
<details>
<summary>Plan: 11 to add, 0 to change, 7 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.production.module.egress-proxy.cloudfoundry_app.egress_app will be destroyed
  # (because cloudfoundry_app.egress_app is not in configuration)
  - resource "cloudfoundry_app" "egress_app" {
      - buildpack                       = "binary_buildpack" -> null
      - command                         = "./caddy run --config Caddyfile" -> null
      - disk_quota                      = 1024 -> null
      - enable_ssh                      = true -> null
      - environment                     = (sensitive value) -> null
      - health_check_invocation_timeout = 0 -> null
      - health_check_timeout            = 0 -> null
      - health_check_type               = "port" -> null
      - id                              = "b0a1c599-8e67-40f0-90ed-3cdea8a1e97a" -> null
      - id_bg                           = "b0a1c599-8e67-40f0-90ed-3cdea8a1e97a" -> null
      - instances                       = 2 -> null
      - memory                          = 64 -> null
      - name                            = "egress" -> null
      - path                            = "../shared/modules/egress-proxy/proxy.zip" -> null
      - ports                           = [
          - 8080,
        ] -> null
      - source_code_hash                = "9fcf4a7f6abfc9a220de2b8bb97591ab490a271ac0933b984f606f645319e1a4" -> null
      - space                           = "2aaa890e-eda6-4c58-bf21-216d9ef1e901" -> null
      - stack                           = "cflinuxfs4" -> null
      - stopped                         = false -> null
      - strategy                        = "rolling" -> null
      - timeout                         = 60 -> null

      - routes {
          - port  = 8080 -> null
          - route = "348e1a2d-689e-4a5a-a745-23e32b5df418" -> null
        }
    }

  # module.production.module.egress-proxy.cloudfoundry_network_policy.client_routing["fac-av-production"] will be destroyed
  # (because cloudfoundry_network_policy.client_routing is not in configuration)
  - resource "cloudfoundry_network_policy" "client_routing" {
      - id = "7b85e38c-582c-f5f0-8f79-e646a4835469" -> null

      - policy {
          - destination_app = "b0a1c599-8e67-40f0-90ed-3cdea8a1e97a" -> null
          - port            = "61443" -> null
          - protocol        = "tcp" -> null
          - source_app      = "5d0afa4f-527b-472a-8671-79a60335417f" -> null
        }
    }

  # module.production.module.egress-proxy.cloudfoundry_network_policy.client_routing["gsa-fac"] will be destroyed
  # (because cloudfoundry_network_policy.client_routing is not in configuration)
  - resource "cloudfoundry_network_policy" "client_routing" {
      - id = "927715e7-7ad9-fe4f-dbde-db314a33ef1c" -> null

      - policy {
          - destination_app = "b0a1c599-8e67-40f0-90ed-3cdea8a1e97a" -> null
          - port            = "61443" -> null
          - protocol        = "tcp" -> null
          - source_app      = "5dac166f-2fb0-4e72-8d4d-4359191bf284" -> null
        }
    }

  # module.production.module.egress-proxy.cloudfoundry_route.egress_route will be destroyed
  # (because cloudfoundry_route.egress_route is not in configuration)
  - resource "cloudfoundry_route" "egress_route" {
      - domain   = "26df58ef-0c0d-4997-b68b-8defb7b3998b" -> null
      - endpoint = "gsa-tts-oros-fac-production-egress-egress.apps.internal" -> null
      - hostname = "gsa-tts-oros-fac-production-egress-egress" -> null
      - id       = "348e1a2d-689e-4a5a-a745-23e32b5df418" -> null
      - space    = "2aaa890e-eda6-4c58-bf21-216d9ef1e901" -> null
    }

  # module.production.module.egress-proxy.cloudfoundry_user_provided_service.credentials will be destroyed
  # (because cloudfoundry_user_provided_service.credentials is not in configuration)
  - resource "cloudfoundry_user_provided_service" "credentials" {
      - credentials = (sensitive value) -> null
      - id          = "85ea6d3f-35ed-4bf9-bf89-4c5fdd82ce71" -> null
      - name        = "egress-creds" -> null
      - space       = "5593dba8-7023-49a5-bdbe-e809fe23edf9" -> null
      - tags        = [] -> null
    }

  # module.production.module.egress-proxy.random_password.password will be destroyed
  # (because random_password.password is not in configuration)
  - resource "random_password" "password" {
      - bcrypt_hash = (sensitive value) -> null
      - id          = "none" -> null
      - length      = 16 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - numeric     = true -> null
      - result      = (sensitive value) -> null
      - special     = false -> null
      - upper       = true -> null
    }

  # module.production.module.egress-proxy.random_uuid.username will be destroyed
  # (because random_uuid.username is not in configuration)
  - resource "random_uuid" "username" {
      - id     = "de3fe50f-55a9-847f-a66f-f02d0340113b" -> null
      - result = "de3fe50f-55a9-847f-a66f-f02d0340113b" -> null
    }

  # module.production.module.https-proxy.cloudfoundry_app.egress_app will be created
  + resource "cloudfoundry_app" "egress_app" {
      + buildpack                       = "binary_buildpack"
      + command                         = "./caddy run --config Caddyfile"
      + disk_quota                      = (known after apply)
      + enable_ssh                      = (known after apply)
      + environment                     = (sensitive value)
      + health_check_http_endpoint      = (known after apply)
      + health_check_invocation_timeout = (known after apply)
      + health_check_timeout            = (known after apply)
      + health_check_type               = "port"
      + id                              = (known after apply)
      + id_bg                           = (known after apply)
      + instances                       = 2
      + memory                          = 64
      + name                            = "https-proxy"
      + path                            = "../shared/modules/https-proxy/proxy.zip"
      + ports                           = (known after apply)
      + source_code_hash                = "9fcf4a7f6abfc9a220de2b8bb97591ab490a271ac0933b984f606f645319e1a4"
      + space                           = "2aaa890e-eda6-4c58-bf21-216d9ef1e901"
      + stack                           = (known after apply)
      + stopped                         = false
      + strategy                        = "rolling"
      + timeout                         = 60

      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }
    }

  # module.production.module.https-proxy.cloudfoundry_network_policy.client_routing["fac-av-production"] will be created
  + resource "cloudfoundry_network_policy" "client_routing" {
      + id = (known after apply)

      + policy {
          + destination_app = (known after apply)
          + port            = "61443"
          + protocol        = "tcp"
          + source_app      = "5d0afa4f-527b-472a-8671-79a60335417f"
        }
    }

  # module.production.module.https-proxy.cloudfoundry_network_policy.client_routing["gsa-fac"] will be created
  + resource "cloudfoundry_network_policy" "client_routing" {
      + id = (known after apply)

      + policy {
          + destination_app = (known after apply)
          + port            = "61443"
          + protocol        = "tcp"
          + source_app      = "5dac166f-2fb0-4e72-8d4d-4359191bf284"
        }
    }

  # module.production.module.https-proxy.cloudfoundry_route.egress_route will be created
  + resource "cloudfoundry_route" "egress_route" {
      + domain   = "26df58ef-0c0d-4997-b68b-8defb7b3998b"
      + endpoint = (known after apply)
      + hostname = "gsa-tts-oros-fac-production-egress-https-proxy"
      + id       = (known after apply)
      + port     = (known after apply)
      + space    = "2aaa890e-eda6-4c58-bf21-216d9ef1e901"
    }

  # module.production.module.https-proxy.cloudfoundry_user_provided_service.credentials will be created
  + resource "cloudfoundry_user_provided_service" "credentials" {
      + credentials = (sensitive value)
      + id          = (known after apply)
      + name        = "https-proxy-creds"
      + space       = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
    }

  # module.production.module.https-proxy.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 16
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # module.production.module.https-proxy.random_uuid.username will be created
  + resource "random_uuid" "username" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.production.module.smtp-proxy.cloudfoundry_app.egress_app will be created
  + resource "cloudfoundry_app" "egress_app" {
      + buildpack                       = "nginx_buildpack"
      + disk_quota                      = (known after apply)
      + enable_ssh                      = (known after apply)
      + environment                     = (sensitive value)
      + health_check_http_endpoint      = (known after apply)
      + health_check_invocation_timeout = (known after apply)
      + health_check_timeout            = (known after apply)
      + health_check_type               = "port"
      + id                              = (known after apply)
      + id_bg                           = (known after apply)
      + instances                       = 2
      + memory                          = 64
      + name                            = "smtp-proxy"
      + path                            = "../shared/modules/stream-proxy/proxy.zip"
      + ports                           = (known after apply)
      + source_code_hash                = "e60fde86b7b0b2dd8316d9e3a73e1b7b03a50a0a311c851a7cbb7d8b84689206"
      + space                           = "2aaa890e-eda6-4c58-bf21-216d9ef1e901"
      + stack                           = (known after apply)
      + stopped                         = false
      + strategy                        = "rolling"
      + timeout                         = 60

      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }
    }

  # module.production.module.smtp-proxy.cloudfoundry_network_policy.client_routing["gsa-fac"] will be created
  + resource "cloudfoundry_network_policy" "client_routing" {
      + id = (known after apply)

      + policy {
          + destination_app = (known after apply)
          + port            = "8080"
          + protocol        = "tcp"
          + source_app      = "5dac166f-2fb0-4e72-8d4d-4359191bf284"
        }
    }

  # module.production.module.smtp-proxy.cloudfoundry_route.egress_route will be created
  + resource "cloudfoundry_route" "egress_route" {
      + domain   = "26df58ef-0c0d-4997-b68b-8defb7b3998b"
      + endpoint = (known after apply)
      + hostname = "gsa-tts-oros-fac-production-egress-smtp-proxy"
      + id       = (known after apply)
      + port     = (known after apply)
      + space    = "2aaa890e-eda6-4c58-bf21-216d9ef1e901"
    }

  # module.production.module.smtp-proxy.cloudfoundry_user_provided_service.credentials will be created
  + resource "cloudfoundry_user_provided_service" "credentials" {
      + credentials = (sensitive value)
      + id          = (known after apply)
      + name        = "smtp-proxy-creds"
      + space       = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
    }

Plan: 11 to add, 0 to change, 7 to destroy.
```
</details>

:memo: Plan generated in [Tests for PRs #359](https://github.com/GSA-TTS/FAC/actions/runs/5137054957)